pramodthe/esp32-agui/esp32-agui/main/esp32_agui_main.c
    cJSON_Delete(tools);                           // cJSON_Delete(NULL) is safe
    if (s_aborting || s_run_error) {               // barge-in or real error → tear down any live stream
        if (s_tts_streaming) { soniox_tts_cancel(); soniox_tts_wait_drained(3000); }  // BIT_CANCEL → quick close + unlock
        s_responding = false;
        return;                                    // abort: new turn owns the UI; error: keep "Error" up
    }
    if (s_tts_streaming) {                          // P-b: the reply streamed live → finalize it
        chat_ui_status("Speaking...");
        soniox_tts_finish();                        // text_end:true ONCE for the whole turn
        soniox_tts_wait_drained(30000);             // play out the tail (30 s no-audio stall cap, not total)
        if (s_aborting) { s_responding = false; return; }  // barged in during the spoken tail
    } else if (s_tts_len > 0) {                     // delta-less / streaming-open-failed → P-a batch fallback
        chat_ui_status("Speaking...");
        tts_speak_reply(s_tts_text);
        if (s_aborting) { s_responding = false; return; }
    }
    chat_ui_status(IDLE_HINT);                     // back to the idle prompt
    s_responding = false;
}

// ---- PTT "go ahead and talk" beep -------------------------------------------------------------
// A short, subtle sine cue played on the ES8311 speaker the instant a hold starts. It plays from
// ptt_task BEFORE soniox_session_start() creates capture_task, so it never glitches an in-flight
// mic read. The speaker is a second esp_codec_dev OUT handle that coexists with the always-open mic
// IN handle on the single ES8311; both MUST use the same 16k/16/1 format (the shared codec/I2S
// clock's last set_fs wins — and it is NOT auto-enforced, so BEEP_SR is hard-pinned). Opening the
// speaker soft-resets the shared chip (clobbers the mic ADC gain) and its acoustic crosstalk lands
// in the live RX DMA ring — capture_task compensates by re-asserting the mic gain and draining the
// ring before it forwards any audio (see soniox_client capture_task).
#define BEEP_SR        16000   // MUST equal soniox_client DEFAULT_SR (the mic rate)
#define BEEP_MS        90      // duration of one beep
#define BEEP_FADE_MS   6       // linear fade in AND out — kills edge clicks
#define BEEP_VOL       75      // esp_codec_dev out-vol INDEX 0-100 (NOT dB; 0 would be -96 dB = silent).
                               // Shared by both tones at a known-good analog gain; loudness is set by the
                               // digital amplitude below, so neither tone overdrives the PA.
// Two tones share the speaker: a SUBTLE PTT "go ahead" cue and a LOUDER, higher-pitched timer alarm.
// Loudness ≈ amplitude / 32767 of full scale (clean headroom — alarm can go toward ~30000 for more).
#define CUE_FREQ       950     // Hz — subtle mid tone for the PTT cue
#define CUE_AMPL       6000    // ~0.18 FS — subtle (unchanged)
#define ALARM_FREQ     1760    // Hz — higher pitched, more attention-getting (loudness ramps in
                               // run_timer_alarm via ALARM_LEVELS, so there's no fixed alarm amplitude)
#define BEEP_SAMPLES   (BEEP_SR * BEEP_MS / 1000)        // 1440
#define BEEP_FADE_N    (BEEP_SR * BEEP_FADE_MS / 1000)   // 96

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

static esp_codec_dev_handle_t s_spk;              // speaker OUT handle, opened once and kept open
static int16_t s_cue_pcm[BEEP_SAMPLES];           // PTT cue (subtle)
static int16_t s_alarm_pcm[BEEP_SAMPLES];         // timer alarm (loud, higher)
static bool    s_beep_ready;

// Fill `buf` with a `freq` sine at 16k mono, linear fade-in/out on the edges so the buffer's
// start/end discontinuities don't click. Peak ±ampl; keep ampl < 32767 so it can't digitally clip.
static void fill_tone(int16_t *buf, int freq, int ampl)
{
    const double w = 2.0 * M_PI * (double)freq / (double)BEEP_SR;
    for (int i = 0; i < BEEP_SAMPLES; i++) {
        double env = 1.0;                                            // anti-click amplitude envelope
        if (i < BEEP_FADE_N)                       env = (double)i / BEEP_FADE_N;
        else if (i >= BEEP_SAMPLES - BEEP_FADE_N)  env = (double)(BEEP_SAMPLES - 1 - i) / BEEP_FADE_N;
        buf[i] = (int16_t)lrint(sin(w * i) * env * ampl);
    }
}

static int s_spk_vol = -1;  // last out-vol set on s_spk (-1 = unknown / just (re)opened)
static int s_tts_vol = 90;  // spoken-reply volume 0-100, set by the volume buttons, loaded from NVS at boot

// Lazily bring up the speaker (once). Returns true if s_spk is open at 16k/16/mono. The speaker is a
// second esp_codec_dev OUT handle that coexists with the always-open mic on the single ES8311 — both
// MUST use the same 16k rate. Opened on the first beep/TTS write and kept open (no idle codec-close now).
static bool spk_ensure(void)
{
    if (s_spk) return true;
    s_spk = bsp_audio_codec_speaker_init();                 // pa_pin = GPIO46, raised automatically
    if (!s_spk) { ESP_LOGW(TAG, "speaker init failed"); return false; }
    esp_codec_dev_sample_info_t fs = { .bits_per_sample = 16, .channel = 1, .sample_rate = BEEP_SR };
    if (esp_codec_dev_open(s_spk, &fs) != ESP_OK) {         // same 16k as the mic → full-duplex OK
        ESP_LOGW(TAG, "speaker open failed");
        s_spk = NULL;                                       // retry on the next call
        return false;
    }
    s_spk_vol = -1;                                         // force the next user to set its volume
    ESP_LOGI(TAG, "speaker ready (16k mono)");
    return true;
}

// Set the shared speaker volume only when it actually changes (the beep + TTS want different levels;
// avoids an I2C write per audio chunk). 0-100 index, NOT dB.
static void spk_set_vol(int v)
{
    if (s_spk && v != s_spk_vol) { esp_codec_dev_set_out_vol(s_spk, v); s_spk_vol = v; }
}

// Lazily bring up the speaker (once) and play one precomputed tone. Blocks (~90 ms) until it is
// clocked out of the I2S TX DMA. Call ONLY from a task (ptt_task / timer task), never a button cb.
static void play_beep(const int16_t *pcm)
{
    if (!s_beep_ready) {                            // build the cue once; run_timer_alarm (re)fills the
        fill_tone(s_cue_pcm, CUE_FREQ, CUE_AMPL);   // alarm buffer at its current escalation level
        s_beep_ready = true;
    }
    if (!spk_ensure()) return;
    spk_set_vol(BEEP_VOL);
    esp_codec_dev_write(s_spk, (int16_t *)pcm, BEEP_SAMPLES * sizeof(int16_t));   // API wants non-const
}

static void play_ptt_beep(void) { play_beep(s_cue_pcm); }   // PTT "go ahead" cue (existing call sites)

// TTS PCM sink: the soniox_tts_client drain task hands decoded pcm_s16le (16k/mono) here — for both
// streaming (P-b) and batch (P-a) replies. main owns the single speaker handle, so TTS shares it with
// the beep + the low-power codec-close (no 2nd handle), and sets the louder spoken-reply volume here.
static void tts_pcm_write(const void *pcm, size_t bytes)
{
    if (!spk_ensure()) return;
    spk_set_vol(s_tts_vol);                          // live: volume-button changes take effect next chunk
    esp_codec_dev_write(s_spk, (void *)pcm, bytes);
}

// Batch fallback used when streaming didn't open (delta-less / open-failed run). Volume is handled by
// the sink (tts_pcm_write), so this is just the blocking speak.
static void tts_speak_reply(const char *text) { soniox_tts_speak(text); }

// --- Volume control -----------------------------------------------------------------------------
// BOOT single-click = volume up, PWR short-press = volume down. The button/PWR callbacks just bump
// s_tts_vol (a plain int) so it takes effect LIVE — the TTS drain task reads it every chunk via
// tts_pcm_write, so you can turn a too-loud reply down mid-sentence. They also enqueue ev=3/4 to
// ptt_task for the non-time-critical feedback (a tick at the new level + status + NVS persist).
// Persisted so the level survives a power-cycle (the user powers off to save battery).
#define VOL_STEP    10
#define VOL_DEFAULT 90

