pramodthe/esp32-agui/esp32-agui/main/esp32_agui_main.c
static void vol_bump(int delta)             // runs in a button/screen cb — int write only, non-blocking
{
    int v = s_tts_vol + delta;
    if (v < 0) v = 0; else if (v > 100) v = 100;
    s_tts_vol = v;
    chat_ui_note_activity();                // wake the display on a volume press
    int e = delta > 0 ? 3 : 4;
    xQueueSend(s_ptt_q, &e, 0);             // ptt_task: tick + status + persist
}

// Play the short cue tone AT the current volume so the user hears the level (eyes-free). Task-context
// only (shares s_spk); ptt_task calls it, never concurrently with a TTS reply (it's blocked then).
static void play_vol_tick(void)
{
    if (!s_beep_ready) { fill_tone(s_cue_pcm, CUE_FREQ, CUE_AMPL); s_beep_ready = true; }
    if (!spk_ensure()) return;
    spk_set_vol(s_tts_vol);
    esp_codec_dev_write(s_spk, s_cue_pcm, BEEP_SAMPLES * sizeof(int16_t));
}

static void vol_feedback(void)              // ptt_task ev=3/4 handler
{
    char s[24];
    snprintf(s, sizeof s, "Volume: %d%%", s_tts_vol);
    chat_ui_status(s);
    play_vol_tick();
    char val[8];
    snprintf(val, sizeof val, "%d", s_tts_vol);
    app_cfg_set(APP_CFG_TTS_VOL, val);      // persist (NVS); a few writes/session — negligible wear
}

// --- Idle low-power (RESTORED to the known-good d0dd24b9 config) --------------------------------
// Removing this whole block broke the STT upload (transport_poll_write(0) / block-ack teardown) even on
// good WiFi — the WiFi/TLS path depends on PM being configured with light_sleep_enable=true + the
// NO_LIGHT_SLEEP lock HELD while active (released only on battery-idle). On battery-idle (display off)
// lp_idle sheds WiFi + the codec and releases the lock so the CPU light-sleeps; lp_wake reverses it.
// Plugged-in stays fully on (lp_idle is a no-op on USB), so no latency cost there.
static volatile bool        s_lp_suspended;
static SemaphoreHandle_t    s_lp_mutex;
static esp_pm_lock_handle_t s_lp_lock;     // NO_LIGHT_SLEEP — HELD while active, released only when idle
static esp_pm_lock_handle_t s_cpu_lock;    // CPU_FREQ_MAX  — HELD only for the duration of a turn (latency)

static void lp_wake(void)   // bring WiFi + codec back if shed; exactly-once
{
    if (!s_lp_mutex) return;
    xSemaphoreTake(s_lp_mutex, portMAX_DELAY);
    if (s_lp_suspended) {
        s_lp_suspended = false;
        if (s_lp_lock) esp_pm_lock_acquire(s_lp_lock);   // no light sleep while active
        soniox_client_mic_start();                       // re-enable the mic I2S (+ gain) for the turn
        net_wifi_resume();
    }
    xSemaphoreGive(s_lp_mutex);
}

static void lp_idle(void)   // shed everything when idle — only on battery (plugged-in stays connected)
{
    // Never shed mid-response (a long spoken reply can outlast the 60 s screen-idle blank).
    if (!s_lp_mutex || s_lp_suspended || s_responding || !device_tools_on_battery()) return;
    xSemaphoreTake(s_lp_mutex, portMAX_DELAY);
    if (!s_lp_suspended) {
        s_lp_suspended = true;
        soniox_client_mic_stop();                                // disable the mic I2S (RX)
        if (s_spk) { esp_codec_dev_close(s_spk); s_spk = NULL; s_spk_vol = -1; } // disable the speaker I2S (TX)
        net_wifi_suspend();
        if (s_lp_lock) esp_pm_lock_release(s_lp_lock);           // WiFi+I2S now off → allow light sleep
    }
    xSemaphoreGive(s_lp_mutex);
}

static void lp_set(bool display_on)   // chat_ui display-state hook (runs on the screen-power task)
{
    if (display_on) lp_wake();
    else            lp_idle();
}

static void power_mgmt_start(void)
{
    s_lp_mutex = xSemaphoreCreateMutex();
    esp_pm_config_t pmc = { .max_freq_mhz = 240, .min_freq_mhz = 80, .light_sleep_enable = true };
    if (esp_pm_configure(&pmc) != ESP_OK) { ESP_LOGW(TAG, "PM configure failed (CONFIG_PM_ENABLE?)"); return; }
    if (esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "active", &s_lp_lock) != ESP_OK) return;
    esp_pm_lock_acquire(s_lp_lock);   // active at boot → no light sleep until lp_idle releases it
    // Latency: a CPU_FREQ_MAX lock acquired only for the span of a turn (turn_perf) so the 3 TLS
    // handshakes (STT/AG-UI/TTS) + JSON parsing run at 240 MHz instead of ramping up from the 80 MHz
    // DFS floor between network round-trips. NOT held at idle, so DFS still saves power between turns.
    if (esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "turn", &s_cpu_lock) != ESP_OK)
        ESP_LOGW(TAG, "PM: CPU_FREQ_MAX lock create failed (turns run at DFS speed)");
    ESP_LOGI(TAG, "PM: light sleep when idle (WiFi + codec off, on battery)");
}

// Full-throttle for the span of a turn: low-latency WiFi (PS=NONE) + CPU pinned to 240 MHz. Paired
// 1:1 (one true at PRESS, one false on every turn-exit) so the counted PM lock can't drift.
static void turn_perf(bool on)
{
    net_low_latency(on);
    if (s_cpu_lock) { if (on) esp_pm_lock_acquire(s_cpu_lock); else esp_pm_lock_release(s_cpu_lock); }
}

// PTT state machine: press → open STT + stream; release → stop, assemble the utterance, run it.
static void ptt_task(void *arg)
{
    for (;;) {
        int ev;
        if (xQueueReceive(s_ptt_q, &ev, portMAX_DELAY) != pdTRUE) continue;

        if (ev == 1 && !s_listening) {                 // PRESS (incl. a barge-in restart)
            s_aborting   = false;                      // P-c: consume the barge-in flags for the new turn
            s_responding = false;                      // (the aborted turn is fully torn down by now)
            s_ptt_final[0] = '\0';
            s_ptt_run[0]   = '\0';
            s_listening = true;
            lp_wake();                                 // woke from battery-idle? bring WiFi + codec back…
            if (!net_is_connected()) {                 // …and wait for the link before streaming to Soniox
                chat_ui_status("Connecting...");
                for (int i = 0; i < 100 && !net_is_connected(); i++) vTaskDelay(pdMS_TO_TICKS(50)); // ~5s
            }
            if (!net_is_connected()) {                 // gave up → don't open a doomed session
                s_listening = false;
                chat_ui_status("No WiFi");
                ESP_LOGW(TAG, "wake: WiFi did not reconnect");
                continue;
            }
            turn_perf(true);                           // low-latency WiFi + 240 MHz CPU for the whole turn
            chat_ui_status("Listening...");
            play_ptt_beep();                           // "go ahead" cue; plays & returns before capture starts
            soniox_cfg_t scfg = { 0 };                 // api_key from NVS
            if (soniox_session_start(&scfg, on_partial, on_turn, NULL) != ESP_OK) {
                s_listening = false;
                turn_perf(false);                      // no turn will run; restore power-save now
                chat_ui_status("STT error");
                ESP_LOGE(TAG, "STT failed to start");
            }
        } else if (ev == 0 && s_listening) {           // RELEASE
            s_listening = false;
            soniox_session_stop();                     // ws task is gone after this; buffers are stable
            if (soniox_last_error()) {                 // STT upload/transport died (e.g. hotspot congestion)
                ESP_LOGW(TAG, "STT failed: %s", soniox_last_error());
                chat_ui_status("Network — hold to retry");   // don't silently drop the turn
                turn_perf(false);
                continue;
            }
            char turn[1024];
            snprintf(turn, sizeof turn, "%s%s", s_ptt_final, s_ptt_run);
            char *t = turn;                            // trim surrounding whitespace
            while (*t == ' ' || *t == '\t') t++;
            size_t n = strlen(t);
            while (n && (t[n-1] == ' ' || t[n-1] == '\t' || t[n-1] == '\n')) t[--n] = '\0';
            if (*t) run_agent_turn(t);             // owns its terminal status (idle hint / "Error")
            else    chat_ui_status(IDLE_HINT);
            turn_perf(false);                      // turn done (reply streamed) → back to power-save

