pramodthe/esp32-agui/esp32-agui/main/esp32_agui_main.c
        } else if (ev == 2 && !s_listening) {      // DOUBLE-TAP → reopen setup portal (change endpoint etc.)
            chat_ui_status("Setup: join 'AMOLED-setup'");
            ESP_LOGI(TAG, "reconfigure: opening portal (only entered fields are saved)");
            net_portal_start("AMOLED-setup");
            bool saved = net_portal_wait_saved(180000);   // up to 3 min, then auto-close
            net_portal_stop();
            ESP_LOGI(TAG, "reconfigure: %s", saved ? "saved" : "timed out");
            if (saved) {
                apply_timezone();          // P5: TZ may have changed in the portal
                char v[8];                 // screen blank timeout may have changed → apply live (no reboot)
                if (app_cfg_get(APP_CFG_SCREEN_TO, v, sizeof v)) {
                    int n = atoi(v);
                    if (n >= 0 && n <= 86400) chat_ui_set_screen_timeout_s(n);
                }
                char ia[4];                // idle-animation flag may have changed → apply live
                chat_ui_set_idle_anim_enabled(app_cfg_get(APP_CFG_IDLE_ANIM, ia, sizeof ia) && ia[0] == '1');
            }
            chat_ui_status(IDLE_HINT);

        } else if (ev == 3 || ev == 4) {           // VOLUME up/down feedback (s_tts_vol already bumped)
            vol_feedback();                        // tick at the new level + "Volume: N%" + persist
        }
    }
}

// Any BOOT-button interaction wakes the display (note_activity un-arms a PWR-forced-off screen too),
// so reaching for the button to talk lights the screen even if it had blanked.
static void ptt_down_cb(void *btn, void *ctx)
{
    chat_ui_note_activity();
    if (s_responding) {                  // P-c BARGE-IN: a press while a reply is in flight aborts it
        ESP_LOGI(TAG, "barge-in: aborting active reply");
        s_aborting = true;               // set BEFORE agui_abort so h_error (fires inline) suppresses "Error"
        agui_abort();                    // cancel the AG-UI run (no-op if already past it)
        soniox_tts_cancel();             // stop TTS playback (no-op if not speaking)
    }
    int e = 1; xQueueSend(s_ptt_q, &e, 0);   // enqueue the press; ptt_task starts a fresh turn once unblocked
}
static void ptt_up_cb(void *btn, void *ctx)   { chat_ui_note_activity(); int e = 0; xQueueSend(s_ptt_q, &e, 0); }  // release
static void ptt_dbl_cb(void *btn, void *ctx)  { chat_ui_note_activity(); int e = 2; xQueueSend(s_ptt_q, &e, 0); }  // double-tap → setup
static void ptt_vol_cb(void *btn, void *ctx)  { vol_bump(VOL_STEP); }    // BOOT single-click → volume UP

// Touch-to-talk (eyes-free): long-press anywhere on the screen → same as a BOOT hold. Fires from the
// LVGL task (display lock held) via chat_ui_set_talk_cb, so it only flips flags + enqueues (the same
// non-blocking contract as the button cbs). ev: 1 = hold start, 0 = release.
static void talk_cb(int ev, void *ctx)
{
    chat_ui_note_activity();
    if (ev == 1 && s_responding) {           // barge-in parity with the BOOT hold
        ESP_LOGI(TAG, "barge-in (touch): aborting active reply");
        s_aborting = true;
        agui_abort();
        soniox_tts_cancel();
    }
    int e = ev; xQueueSend(s_ptt_q, &e, 0);
}

// PWR (AXP2101 PWRKEY) short press → volume DOWN. Fires from chat_ui's screen-power task.
static void pwr_vol_cb(void) { vol_bump(-VOL_STEP); }

static esp_err_t ptt_button_init(void)
{
    // BOOT: a quick TAP = volume up; a HOLD (>= long_press_time) = push-to-talk (fallback to the
    // touchscreen invoke); a DOUBLE-tap = setup portal. SINGLE_CLICK waits out the double-click window,
    // so a double-tap fires the portal only (no stray volume bump).
    button_config_t bcfg = { .long_press_time = 300 };
    button_gpio_config_t gcfg = { .gpio_num = PTT_GPIO, .active_level = 0 };   // BOOT pulls GPIO0 low
    button_handle_t btn;
    esp_err_t err = iot_button_new_gpio_device(&bcfg, &gcfg, &btn);
    if (err != ESP_OK) return err;
    iot_button_register_cb(btn, BUTTON_SINGLE_CLICK,     NULL, ptt_vol_cb,  NULL);  // tap → volume up
    iot_button_register_cb(btn, BUTTON_LONG_PRESS_START, NULL, ptt_down_cb, NULL);  // hold → talk (fallback)
    iot_button_register_cb(btn, BUTTON_PRESS_UP,         NULL, ptt_up_cb,   NULL);  // release → stop + run
    iot_button_register_cb(btn, BUTTON_DOUBLE_CLICK,     NULL, ptt_dbl_cb,  NULL);  // double-tap → setup portal
    return ESP_OK;
}

// A firing timer RINGS until the screen is tapped: bursts of 4 quick beeps with a big red ring
// flashing on/off in sync, then a dark pause, repeating — and getting LOUDER every few cycles. Runs
// on the timer task. chat_ui_alarm_set() shows the red-ring overlay + suspends the idle power-saver;
// we poll chat_ui_touch_idle_ms() for the dismiss tap (object-independent, so a tap anywhere counts).
// Auto-stops after ALARM_MAX_MS, or if BOOT is held to start a turn (s_listening).
#define ALARM_BRIGHT     90
#define ALARM_BEEPS      4
#define ALARM_GAP_MS     150
#define ALARM_PAUSE_MS   900
#define ALARM_MAX_MS     120000
#define ALARM_CYCLES_PER_LEVEL 4   // beep cycles at each loudness before stepping up
// Escalating loudness — int16 amplitudes (~/32767 of full scale). Start ~half the comfortable level
// and step up every ALARM_CYCLES_PER_LEVEL cycles until dismissed; top stays clear of clipping.
static const int ALARM_LEVELS[] = { 6500, 10000, 15000, 21000, 28000 };  // ~0.20,0.30,0.46,0.64,0.85 FS
#define ALARM_NLEVELS ((int)(sizeof ALARM_LEVELS / sizeof ALARM_LEVELS[0]))

// True once a fresh dismiss tap is seen — but only after the screen has first gone quiet, so a tap
// just before the timer fired doesn't instantly dismiss it. `*armed` persists across calls.
static bool alarm_dismiss_tap(bool *armed)
{
    uint32_t ti = chat_ui_touch_idle_ms();
    if (ti > 600) *armed = true;            // quiet (finger up / no recent touch) → ready to accept a tap
    return *armed && ti < 250;              // a touch within the last 250ms
}

static void run_timer_alarm(const char *label)
{
    chat_ui_note_activity();
    chat_ui_alarm_set(true);                 // black overlay + red ring; suspends the idle saver

    int64_t start = esp_timer_get_time();
    bool armed = false, done = false;
    int  cycle = 0, level = -1;
    while (!done && !s_listening && (esp_timer_get_time() - start) < (int64_t)ALARM_MAX_MS * 1000) {
        int want = cycle / ALARM_CYCLES_PER_LEVEL;            // escalate loudness over cycles
        if (want >= ALARM_NLEVELS) want = ALARM_NLEVELS - 1;
        if (want != level) { level = want; fill_tone(s_alarm_pcm, ALARM_FREQ, ALARM_LEVELS[level]); }

        for (int i = 0; i < ALARM_BEEPS && !done; i++) {
            chat_ui_alarm_flash(true);           // red ring ON (LVGL paints it; panel stays lit)…
            vTaskDelay(pdMS_TO_TICKS(20));        // let the "on" frame land before the beep
            play_beep(s_alarm_pcm);              // ~90ms (blocks)
            chat_ui_alarm_flash(false);          // …ring hidden (dark) between
            vTaskDelay(pdMS_TO_TICKS(ALARM_GAP_MS));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        for (int t = 0; t < ALARM_PAUSE_MS && !done; t += 50) {   // dark pause, polling for the tap
            vTaskDelay(pdMS_TO_TICKS(50));
            if (alarm_dismiss_tap(&armed) || s_listening) done = true;
        }
        cycle++;
    }
    chat_ui_alarm_set(false);                // remove overlay; resume saver; screen on
    bsp_display_brightness_set(ALARM_BRIGHT);
    char msg[72];
    snprintf(msg, sizeof msg, "Timer done%s%s", label[0] ? ": " : "", label);
    chat_ui_status(msg);
}

