pramodthe/esp32-agui/esp32-agui/main/esp32_agui_main.c
// Poll the device timer (~1s): when a set_timer elapses, ring the alarm until the screen is tapped.
static void timer_alert_task(void *arg)
{
    QueueHandle_t q = device_tools_timer_queue();
    char label[40];
    for (;;) {
        uint8_t sig;
        xQueueReceive(q, &sig, portMAX_DELAY);   // BLOCKS until a set_timer fires — no periodic wake,
        if (device_tools_timer_take_fired(label, sizeof label))   // so the CPU can light-sleep until then
            run_timer_alarm(label);
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "AG-UI voice client booting (P0-P3)");
    init_nvs();

    device_tools_init();
    chat_ui_init();
    agui_client_init();

    // Provision until we have WiFi + Soniox key + AG-UI URL.
    ESP_ERROR_CHECK(net_prov_init());
    for (;;) {
        bool wifi_ok = net_is_connected() || (net_connect_saved(15000) == ESP_OK);
        bool key_ok  = app_cfg_has(APP_CFG_SONIOX_KEY);
        bool url_ok  = app_cfg_has(APP_CFG_AGUI_URL);
        if (wifi_ok && key_ok && url_ok) break;
        chat_ui_status("Setup: join 'AMOLED-setup'");
        ESP_LOGW(TAG, "provisioning (wifi=%d key=%d url=%d) — opening 'AMOLED-setup'", wifi_ok, key_ok, url_ok);
        net_portal_start("AMOLED-setup");
        net_portal_wait_saved(0);
        net_portal_stop();
    }
    net_start_auto_reconnect();
    apply_timezone();                  // P5: load POSIX TZ (default UTC0) for local_time
    net_sntp_start();                  // P5: sync wall-clock time for ambient context (local_time)
    ESP_LOGI(TAG, "network + keys ready");

    // Bring the mic up now; the Soniox WSS opens only on a PTT press.
    if (soniox_client_init() != ESP_OK) ESP_LOGE(TAG, "mic init failed");
    if (soniox_tts_init(tts_pcm_write) != ESP_OK) ESP_LOGE(TAG, "tts init failed");  // P-a: spoken replies

    // Spoken-reply volume from NVS (set by the volume buttons); default VOL_DEFAULT if unset.
    { char v[8]; if (app_cfg_get(APP_CFG_TTS_VOL, v, sizeof v)) { int n = atoi(v); if (n >= 0 && n <= 100) s_tts_vol = n; } }

    power_mgmt_start();   // low-power: light sleep when idle (creates the lp mutex before ptt_task uses it)

    // Push-to-talk: long-press the SCREEN (eyes-free) or hold BOOT. BOOT tap = vol up, PWR = vol down.
    s_ptt_q = xQueueCreate(8, sizeof(int));
    // agui_run runs on this stack: TLS handshake + the C++ SDK (nlohmann JSON serialize/parse is
    // recursive + C++ exception unwinding), so it needs more headroom than the old cJSON path.
    xTaskCreate(ptt_task, "ptt", 16384, NULL, 5, NULL);
    xTaskCreate(timer_alert_task, "tmralert", 4096, NULL, 3, NULL);   // P7: surface set_timer firings
    if (ptt_button_init() != ESP_OK) ESP_LOGE(TAG, "PTT button init failed");
    chat_ui_status(IDLE_HINT);
    chat_ui_set_talk_cb(talk_cb, NULL);    // touch-to-talk: long-press the screen → start/stop a turn
    chat_ui_set_pwrkey_cb(pwr_vol_cb);     // PWR short-press → volume down
    chat_ui_set_power_cb(lp_set);          // low-power: shed WiFi+codec when the display blanks (on battery)
    // Screen blank timeout from NVS (captive portal): default 60 s, 0 = always on.
    { char v[8]; int s = 60; if (app_cfg_get(APP_CFG_SCREEN_TO, v, sizeof v)) { int n = atoi(v); if (n >= 0 && n <= 86400) s = n; }
      chat_ui_screen_power_start(s); }   // blank after s idle (wake on touch / PWR key / activity); 0 = always on
    { char v[4]; chat_ui_set_idle_anim_enabled(app_cfg_get(APP_CFG_IDLE_ANIM, v, sizeof v) && v[0] == '1'); }  // idle screensaver
    ESP_LOGI(TAG, "ready — long-press the screen or hold BOOT to talk");

    // Heartbeat: link + heap (internal RAM is the scarce one with the display).
    char ip[16];
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(15000));
        if (net_get_ip_str(ip, sizeof ip)) {
            if (!net_time_synced()) net_time_http_fallback();   // P5: set clock via HTTPS if NTP is blocked
            // internal_max = largest contiguous internal block — TLS/lwIP send buffers need
            // contiguous internal RAM, so this matters more than total free when sessions fail.
            ESP_LOGI(TAG, "heartbeat: online ip=%s listening=%d free=%u internal=%u internal_max=%u psram=%u",
                     ip, s_listening, (unsigned)esp_get_free_heap_size(),
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                     (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL),
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
        } else {
            ESP_LOGW(TAG, "heartbeat: offline");
        }
    }
}
